delete from cities;
INSERT INTO cities (id, name) VALUES
-- 24 республики
(1, 'майкоп'),                    -- Республика Адыгея
(2, 'уфа'),                       -- Республика Башкортостан
(3, 'улан-удэ'),                  -- Республика Бурятия
(4, 'горно-алтайск'),             -- Республика Алтай
(5, 'махачкала'),                 -- Республика Дагестан
(6, 'магас'),                     -- Республика Ингушетия
(7, 'нальчик'),                   -- Кабардино-Балкарская Республика
(8, 'элиста'),                    -- Республика Калмыкия
(9, 'черкесск'),                  -- Карачаево-Черкесская Республика
(10, 'петрозаводск'),             -- Республика Карелия
(11, 'сыктывкар'),                -- Республика Коми
(12, 'йошкар-ола'),               -- Республика Марий Эл
(13, 'саранск'),                  -- Республика Мордовия
(14, 'якутск'),                   -- Республика Саха (Якутия)
(15, 'владикавказ'),              -- Республика Северная Осетия — Алания
(16, 'казань'),                   -- Республика Татарстан
(17, 'кызыл'),                    -- Республика Тыва
(18, 'ижевск'),                   -- Удмуртская Республика
(19, 'абакан'),                   -- Республика Хакасия
(95, 'грозный'),                  -- Чеченская Республика
(21, 'чебоксары'),                -- Чувашская Республика
(82, 'симферополь'),              -- Республика Крым
(80, 'донецк'),                   -- Донецкая Народная Республика
(81, 'луганск'),                  -- Луганская Народная Республика

-- 9 краёв
(22, 'барнаул'),                  -- Алтайский край
(41, 'петропавловск-камчатский'), -- Камчатский край
(27, 'хабаровск'),                -- Хабаровский край
(23, 'краснодар'),                -- Краснодарский край
(24, 'красноярск'),               -- Красноярский край
(59, 'пермь'),                    -- Пермский край
(25, 'владивосток'),              -- Приморский край
(26, 'ставрополь'),               -- Ставропольский край
(75, 'чита'),                     -- Забайкальский край

-- 48 областей
(28, 'благовещенск'),             -- Амурская область
(29, 'архангельск'),              -- Архангельская область
(30, 'астрахань'),                -- Астраханская область
(31, 'белгород'),                 -- Белгородская область
(32, 'брянск'),                   -- Брянская область
(33, 'владимир'),                 -- Владимирская область
(34, 'волгоград'),                -- Волгоградская область
(35, 'вологда'),                  -- Вологодская область
(36, 'воронеж'),                  -- Воронежская область
(85, 'запорожье'),                -- Запорожская область
(38, 'иркутск'),                  -- Иркутская область
(37, 'иваново'),                  -- Ивановская область
(39, 'калининград'),              -- Калининградская область
(40, 'калуга'),                   -- Калужская область
(42, 'кемерово'),                 -- Кемеровская область
(43, 'киров'),                    -- Кировская область
(44, 'кострома'),                 -- Костромская область
(45, 'курган'),                   -- Курганская область
(46, 'курск'),                    -- Курская область
(48, 'липецк'),                   -- Липецкая область
(49, 'магадан'),                  -- Магаданская область
(51, 'мурманск'),                 -- Мурманская область
(52, 'нижний новгород'),          -- Нижегородская область
(53, 'великий новгород'),         -- Новгородская область
(54, 'новосибирск'),              -- Новосибирская область
(55, 'омск'),                     -- Омская область
(56, 'оренбург'),                 -- Оренбургская область
(57, 'орёл'),                     -- Орловская область
(58, 'пенза'),                    -- Пензенская область
(60, 'псков'),                    -- Псковская область
(61, 'ростов-на-дону'),           -- Ростовская область
(62, 'рязань'),                   -- Рязанская область
(65, 'южно-сахалинск'),           -- Сахалинская область
(63, 'самара'),                   -- Самарская область
(64, 'саратов'),                  -- Саратовская область
(67, 'смоленск'),                 -- Смоленская область
(66, 'екатеринбург'),             -- Свердловская область
(68, 'тамбов'),                   -- Тамбовская область
(70, 'томск'),                    -- Томская область
(69, 'тверь'),                    -- Тверская область
(71, 'тула'),                     -- Тульская область
(72, 'тюмень'),                   -- Тюменская область
(73, 'ульяновск'),                -- Ульяновская область
(74, 'челябинск'),                -- Челябинская область
(84, 'херсон'),                   -- Херсонская область
(76, 'ярославль'),                -- Ярославская область
(77, 'москва'),                   -- Московская область
(78, 'санкт-петербург'),          -- Ленинградская область

-- 1 автономная область
(79, 'биробиджан'),               -- Еврейская автономная область

-- 4 автономных округа
(83, 'нарьян-мар'),               -- Ненецкий автономный округ
(86, 'ханты-мансийск'),           -- Ханты-Мансийский автономный округ — Югра
(87, 'анадырь'),                  -- Чукотский автономный округ
(89, 'салехард');                 -- Ямало-Ненецкий автономный округ